/*
 * 	반복문 : 반복적인 소스를 모아서 한번에 처리 
 * 	
 * 	for(시작값;끝나는값;증가식)
 * 	1~100
 * 	for(int i=1;i<=100;i++)
 * 	15~250
 * 	for(int i=15;i<=250,i++)
 * 	10~100 10개 증가
 * 	for(int i=10;i<=100;i+=10)
 * 
 * 	=> 합, 곱, 갯수
 * 	  --
 * 	  sum=0	  gop=1   count=0  ==> 산술 연산
 * 	  sum+=i, gop*=i, count++
 * 	---------------------------
 * 	 총 구매액			  구매갯수 ===> 브라우저로 전송 (받은 값을 출력), 모바일로 전송
 * 
 * 	형식)
 * 	while : 무한루프 (종료되지 않는 프로그램) => while(true)
 * 			=> 데이터베이스(핵심)
 * 	초기값	=======>1
 * 	while(조건식)	===>2 false면 종료
 * {		|true
 * 		반복 수행 문장==>3
 * 		증가식 =======>4 =====> 조건식 이동 (2)
 * 	}
 * 	1~100까지 정수 출력
 * 	int i=1;
 * 	while(i<=100)
 * 	{
 * 		출력
 * 		i++;
 * 	}
 * 
 * 	156~157 ==> 이미지에서 순서확인 
 * 	156 ==> 형식
 * 	167 ==> while(형식), 순서
 * 
 * 
 */
public class 반복문정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
